app/controllers/projects_controller.rb

SELECT "vendors".* FROM "vendors"
---
  def new
    @project = Project.all
    @vendor = Vendor.all

INSERT INTO "projects" ("scope", "status", "closure", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["scope", "Housekeeping works"], ["status", "Open"], ["closure", "2019-10-13"], ["description", "Cleaning of hotel rooms outsourcing"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "scope" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["scope", "Build Mega Mall"], ["updated_at", "2019-02-22 03:26:58.478269"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 9]]
---
  def destroy
    @project.destroy