app/controllers/projects_vendors_controller.rb

INSERT INTO "projects_vendors" ("bidPrice", "project_id", "vendor_id") VALUES ($1, $2, $3) RETURNING "id"  [["bidPrice", 100000], ["project_id", 1], ["vendor_id", 1]]
---
  def create
    @projects_vendor = ProjectsVendor.new(projects_vendors_params)

    respond_to do |format|
      if @projects_vendor.save

SELECT  "projects_vendors".* FROM "projects_vendors" WHERE "projects_vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_projects_vendor
      @projects_vendors = ProjectsVendor.find(params[:id])