app/controllers/projects_vendors_controller.rb

SELECT "projects_vendors".* FROM "projects_vendors"
---
  def index
   @projects_vendors = ProjectsVendor.all

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "projects_vendors".* FROM "projects_vendors" WHERE "projects_vendors"."project_id" = $1  [["project_id", 1]]
INSERT INTO "projects_vendors" ("project_id", "vendor_id") VALUES ($1, $2) RETURNING "id"  [["project_id", 1], ["vendor_id", 4]]
---
  def bid
    project = Project.find(params[:projects_vendors][:project_id])

    vendor = Vendor.find(params[:projects_vendors][:vendor_id])

    #bid = ProjectsVendor.find(params[projects_vendors][:bidPrice])

    project.vendors << vendor

SELECT "projects".* FROM "projects"
SELECT "vendors".* FROM "vendors"
---
  def new
    @projects_vendor = ProjectsVendor.new
    @project = Project.all
    @vendor = Vendor.all

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects_vendors".* FROM "projects_vendors" WHERE "projects_vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @projects_vendor = ProjectsVendor.find(params[:id])

INSERT INTO "projects_vendors" ("bidPrice", "project_id", "vendor_id") VALUES ($1, $2, $3) RETURNING "id"  [["bidPrice", 100000], ["project_id", 1], ["vendor_id", 1]]
---
  def create
    @projects_vendor = ProjectsVendor.new(projects_vendors_params)

    respond_to do |format|
      if @projects_vendor.save

DELETE FROM "projects_vendors" WHERE "projects_vendors"."id" = $1  [["id", 2]]
---
  def destroy
    @projects_vendors.destroy

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects_vendors".* FROM "projects_vendors" WHERE "projects_vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_projects_vendor
      @projects_vendors = ProjectsVendor.find(params[:id])