app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def create
    @vendor = Vendor.new(vendor_params)

    respond_to do |format|
      if @vendor.save
---
INSERT INTO "vendors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ABC Builders Pte Ltd"], ["created_at", "2019-02-22 05:43:00.120208"], ["updated_at", "2019-02-22 05:43:00.120208"]]

  def update
    respond_to do |format|
      if @vendor.update(vendor_params)
---
UPDATE "vendors" SET "profile" = $1, "certifications" = $2, "updated_at" = $3 WHERE "vendors"."id" = $4  [["profile", "asdasd"], ["certifications", "asdads"], ["updated_at", "2019-02-27 08:46:48.555876"], ["id", 1]]

    def set_vendor
      @vendor = Vendor.find(params[:id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]